my_list = [1,-1,2,-3,3,-6,4,-9,7]
pos_list = []
neg_list = []
for i in my_list:
    if i > 0:
        pos_list.append(i)
    else:
        neg_list.append(i)
print(pos_list,neg_list)



#კოდის ეს ნაწყვეტი არის დადებითი და უარყოფითი რიცხვების გამოყოფა მოცემული სიიდან `my_list`. ნება მომეცით დაგიშალოთ:
#1. my_list = [1,-1,2,-3,3,-6,4,-9,7]`: ეს სტრიქონი აყალიბებს სიას სახელად "my_list", რომელიც შეიცავს რიცხვების თანმიმდევრობას, როგორც დადებით, ასევე უარყოფითს.
#2. `pos_list = []` და `neg_list = []`: ამ ხაზების ინიციალიზება ხდება ორი ცარიელი სიის სახელწოდებით `pos_list` და `neg_list`. `pos_list` შეინახავს ყველა დადებით რიცხვს `my_list`-დან, ხოლო `neg_list` ინახავს ყველა უარყოფით რიცხვს.
#3. "for" ციკლი მეორდება "my_list"-ის თითოეულ ელემენტში "i".
#4. `if i > 0:`: ეს პირობა ამოწმებს, არის თუ არა მიმდინარე ელემენტი `i` 0-ზე მეტი, ანუ დადებითი რიცხვია.
#5. თუ პირობა მართალია, `pos_list.append(i)` ამატებს დადებით რიცხვს `i` `pos_list`-ს.
#6. თუ პირობა მცდარია (ანუ, `i` არ არის 0-ზე მეტი), `neg_list.append(i)` ამატებს უარყოფით რიცხვს `i` `neg_list-ს.
#7. და ბოლოს, `print(pos_list, neg_list)` ბეჭდავს ორივე სიას, რომლებიც შეიცავს დადებით და უარყოფით რიცხვებს, შესაბამისად.
#ასე რომ, როდესაც ამ კოდს აწარმოებთ, ის გამოვა დადებითი რიცხვები ერთ სიაში და უარყოფითი რიცხვები მეორე სიაში.