#ეკმასკრიპტი (ECMAScript) არის პროგრამირების ენა, რომელსაც იყენებს მრავალრიცხვი ვებ გვერდები და აპლიკაციები. 
#მას აქვს მრავალი ვერსია, მაგრამ ყველაზე ცნობილი და ფართოდ გამოყენებადი არის JavaScript.
#ECMAScript-ის ძირითადი მახასიათებლები:
#•	ბაზა: ECMAScript არის JavaScript-ის საფუძველი. ნებისმიერ JavaScript-ის კოდს შესრულებისას გაივლის ECMAScript-ის სტანდარტებზე.
#•	ფუნქციონალური მხარე: ECMAScript უზრუნველყოფს სხვადასხვა ფუნქციების და მეთოდების შექმნის საშუალებას, 
#რაც ამარტივებს ვებ აპლიკაციების დეველოპერების მუშაობას.
#•	მულტიპლატფორმულობა: ეს ენა გამოიყენება მრავალრიცხოვან ვებ ბრაუზერებში და პლატფორმებზე.
#•	მონაცემთა მართვა: ECMAScript იყენებს ცვლადების და ობიექტების მართვის საშუალებას, რაც უზრუნველყოფს 
#მონაცემთა უსაფრთხო და ეფექტურ მართვას.
#ECMAScript-ის ვერსიები:
#•	ES5: ეს ვერსია მოიცავს სხვადასხვა ახალი ფუნქციების და მახასიათებლების, როგორიცაა 
#ფუნქციების სინთეზი და "strict mode" რეჟიმი.
#•	ES6 (ES2015): ეს ვერსია მოიცავს კლასების, მოდულების და ახალი ცვლადების 
#(let და const) დამატებას.
	
#შემდგომი ვერსიები (ES7, ES8, ...): ამ ვერსიებში დამატებულია ახალი ოპერატორები, ფუნქციები და 
#მახასიათებლები, რაც ამარტივებს და აუმჯობესებს დეველოპერების მუშაობას.
#ECMAScript ძალიან მნიშვნელოვანია და ფართოდ გამოყენებადი ვებ განვითარების სფეროში, 
#რაც მას საუკეთესო არჩევანს ხდის პროგრამირების ენებში. თქვენი ინტერესის სფერო რა არის ამ ენაზე?
