//1
//1)ფუნქციის დეკლარაცია
//2)ახალი მასივის შექმნა
//3)for ციკლის გამოყენება
//4)if პირობის გამოყენება
//5)ახალი მასივის დაბრუნება

//2
//1)ფუნქციის დეკლარაცია
//2)ახალი მასივის შექმნა
//3)for ციკლის გამოყენება
//4)if პირობის გამოყენება
//5)ახალი მასივის დაბრუნება

//3
//1)ინტერვალის შექმნა
//2)Date ობიექტის შექმნა
//3)წუთის შემოწმება
//4)ინტერვალის გათიშვა

//4
//1)Date ობიექტის შექმნა
//2)getFullYear():
//3)getMonth():
//4)getDate():
//5)getDay():
//6)getHours():
//7)getMinutes():
//8)getSeconds():
//9)getMilliseconds():

//5პირველი Date ობიექტი:

//1)ობიექტის შექმნა: new Date("2022-03-25")
//მეთოდების გამოყენება:
//getFullYear(): აბრუნებს წელიწადს (2022)
//getMonth(): აბრუნებს თვეების ინდექსს (2, რადგან მარტი არის 2)
//getDate(): აბრუნებს თვის დღეს (25)
//getDay(): აბრუნებს კვირის დღეს (5, რადგან 25 მარტი 2022 წელს იყო პარასკევი)
//getHours(): აბრუნებს საათებს (0, რადგან დრო არ არის მითითებული)
//getMinutes(): აბრუნებს წუთებს (0)
//getSeconds(): აბრუნებს წამებს (0)
//getMilliseconds(): აბრუნებს მილიწამებს (0)

//2)მეორე Date ობიექტი:
//ობიექტის შექმნა: new Date("October 13, 2014 11:13:00")
//მეთოდების გამოყენება:
//getFullYear(): აბრუნებს წელიწადს (2014)
//getMonth(): აბრუნებს თვეების ინდექსს (9, რადგან ოქტომბერი არის 9)
//getDate(): აბრუნებს თვის დღეს (13)
//getDay(): აბრუნებს კვირის დღეს (1, რადგან 13 ოქტომბერი 2014 წელს იყო ორშაბათი)
//getHours(): აბრუნებს საათებს (11)
//getMinutes(): აბრუნებს წუთებს (13)
//getSeconds(): აბრუნებს წამებს (0)
//getMilliseconds(): აბრუნებს მილიწამებს (0)